
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Если ПустаяСтрока(Данные.ДействуетНаОсновании) Тогда
	Иначе 
		СтандартнаяОбработка = Ложь;
		Представление = СтрШаблон("%1 (на осн.: %2)", Данные.Наименование, Данные.ДействуетНаОсновании);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
КонецПроцедуры
